import React from 'react';

interface IProps {
  className?: string;
}

const Present: React.FC<IProps> = ({ className }) => {
  return (
    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 34.45 34.81" className={className}>
      <g id="Layer_2" data-name="Layer 2">
        <g id="Слой_5" data-name="Слой 5">
          <path d="M34.43 16.07l-.49-3.34a1.77 1.77 0 00-1.76-1.53h-10v6.9h10.5a1.78 1.78 0 001.75-2.03zM.5 12.73L0 16.07a1.78 1.78 0 001.76 2h10.5V11.2h-10A1.78 1.78 0 00.5 12.73zM31.94 33V19.47h-9.77v15.34h7.9A1.87 1.87 0 0031.94 33zM2.51 19.47V33a1.86 1.86 0 001.86 1.86h7.91V19.47z" />
          <rect x="13.63" y="11.2" width="7.19" height="23.61" rx="1.29" />
          <path d="M26.47 5.66c-1.75-2.51-5.26.26-7 2.19a4 4 0 00-.67-.49C22.28 3.23 29.05-3.51 33 2.2c2.43 3.49-.38 7.4-11.67 8.11a3.76 3.76 0 00-.1-.66c4.77-.51 6.38-2.35 5.24-3.99z" />
          <path d="M13 10.31a4.19 4.19 0 018.34 0z" />
          <path d="M8 5.66c1.75-2.51 5.26.26 7 2.19a4 4 0 01.67-.49C12.16 3.23 5.38-3.51 1.4 2.2c-2.4 3.49.38 7.4 11.67 8.11a3.76 3.76 0 01.1-.66C8.45 9.14 6.83 7.3 8 5.66z" />
        </g>
      </g>
    </svg>
  );
};

export default Present;
